<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"5b8a563791b2ded4bdd46316800f20455085daf484d13fb41c2affde2d8b30a6","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #675 at https://github.com/cal-itp/data-infra/actions/runs/17872974594","plan_out_hash":"fe8aedbbd4f2c0bfdc612e5e3a7f19f7fab2f53e2179e4403d20f59be6747339","plan_hash":"62e7a807bbacaf49ecbe27c2fa6ad9047f31bf99c9a2557d52d0d7649e911b67","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/ntd_data_products/multi_year__track_and_roadway_by_agency.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "KHlMmg==" -> (known after apply)
!~      detect_md5hash      = "uRPAddNpBxu55bSEcsJXUw==" -> "different hash"
!~      generation          = 1749661093934904 -> (known after apply)
        id                  = "calitp-staging-composer-dags/create_external_tables/ntd_data_products/multi_year__track_and_roadway_by_agency.yml"
!~      md5hash             = "uRPAddNpBxu55bSEcsJXUw==" -> (known after apply)
        name                = "dags/create_external_tables/ntd_data_products/multi_year__track_and_roadway_by_agency.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/src/bigquery_cleaner.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "ZCQJ5w==" -> (known after apply)
!~      detect_md5hash      = "DUIK+J1A8xVv5Va/7Vh7BQ==" -> "different hash"
!~      generation          = 1758319787198292 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/src/bigquery_cleaner.py"
!~      md5hash             = "DUIK+J1A8xVv5Va/7Vh7BQ==" -> (known after apply)
        name                = "plugins/src/bigquery_cleaner.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_annual_reporting/stg_ntd__track_and_roadway_by_agency.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "NC5+jw==" -> (known after apply)
!~      detect_md5hash      = "R4tcH7NdmHfuZrzmf+vOcA==" -> "different hash"
!~      generation          = 1751997660074376 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_annual_reporting/stg_ntd__track_and_roadway_by_agency.sql"
!~      md5hash             = "R4tcH7NdmHfuZrzmf+vOcA==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_annual_reporting/stg_ntd__track_and_roadway_by_agency.sql"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #675](https://github.com/cal-itp/data-infra/actions/runs/17872974594)